# running in job/src/
read -formal -sv design.sv harness.sv
prep -top counter_tb
flatten
setundef -zero
clk2fflogic

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
